Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnTopBelowBaseError Property
 The column top can't be moved below its base.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnTopBelowBaseError { get; }
Public Shared ReadOnly Property ColumnTopBelowBaseError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnTopBelowBaseError {
	FailureDefinitionId^ get ();
}
static member ColumnTopBelowBaseError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace